Revit 2027 API
BuiltInFailures.GridFailures.GridlineAxisTooFar Property
 Axis of gridlines should not be further than [Value] to each other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlineAxisTooFar { get; }
Public Shared ReadOnly Property GridlineAxisTooFar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlineAxisTooFar {
	FailureDefinitionId^ get ();
}
static member GridlineAxisTooFar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridFailures Class
Autodesk.Revit.DB Namespace